Revit.Elements.Element
Superclass of all Revit element wrappers

Revit.Elements.Element.SafeInit(System.Action)
Handling exceptions when calling the initializing function
init:

Revit.Elements.Element.IsRevitOwned
Indicates whether the element is owned by Revit or not.  If the element
is Revit owned, it should not be deleted by Dispose().

Revit.Elements.Element.InternalUniqueId
The unique id for this element

Revit.Elements.Element.Dispose
Default implementation of dispose that removes the element from the
document

Revit.Elements.Element.ToString
A basic implementation of ToString for Elements
Returns:

Revit.Elements.Element.Equals(System.Object)
Implement Equals() method.
obj:
Returns:

Revit.Elements.Element.GetHashCode
Get hash code.
obj:
Returns:

Revit.Elements.Element.GetParameterValueByName(System.String)
Get the value of one of the element's parameters.
parameterName: The name of the parameter whose value you want to obtain.
Returns:

Revit.Elements.Element.OverrideColorInView(DSCore.Color)
Override the element's color in the active view.
color: The color to apply to a solid fill on the element.

Revit.Elements.Element.SetParameterByName(System.String,System.Object)
Set one of the element's parameters.
parameterName: The name of the parameter to set.
value: The value.

Revit.Elements.Element.Geometry
Get all of the Geometry associated with this object

Revit.Elements.Element.InternalGeometry(System.Boolean)
Extract the Revit GeometryObject's from a Revit Element
Returns:

Revit.Elements.Element.CollectConcreteGeometry(Autodesk.Revit.DB.GeometryElement,System.Boolean)
Collects the concrete GeometryObject's in a GeometryElement, which is a recursive collection of GeometryObject's.
geometryElement: The Geometry collection
useSymbolGeometry: When encountering a GeometryInstance, use GetSymbolGeometry() which obtains usable Reference objects
Returns:

Revit.Elements.Element.InternalGeometry``1(System.Boolean)
A generic method extract all GeometryObject's of the supplied type
Returns:

Revit.Elements.Element.Document
A reference to the current Document.

Revit.Elements.Element.Parameters
Obtain all of the Parameters from an Element

Revit.Elements.Element.Name
Get the Name of the Element

Revit.Elements.Element.BoundingBox
Get an Axis-aligned BoundingBox of the Element

Revit.Elements.Element.Id
Get the Element Id for this element

Revit.Elements.Element.UniqueId
Get the Element Unique Id for this element

Revit.Elements.Element.InternalElement
A reference to the element

Revit.Elements.Element.InternalElementId
The element id for this element

Revit.Elements.Element.Solids
The Solids in this Element

Revit.Elements.Element.Curves
The Curves in this Element

Revit.Elements.Element.Faces
The Faces in this Element

Revit.Elements.Element.ElementCurveReferences
The ElementCurveReference's in this Element.  Useful for downstream
Element creation.

Revit.Elements.Element.ElementFaceReferences
The ElementFaceReference's in this Element.  Useful for downstream
Element creation.

Revit.Elements.Element.IsAlive
Is this element still alive in Revit, and good to be drawn, queried etc.